readme.org
# -*- org-confirm-babel-evaluate: nil; -*-
* Config                                                           :noexport:
** Meta
#+title: Machine Learning
#+subtitle: Portfolio
#+author: Brian Brunner
#+description: Final project for CSC 448: Machine Learning

** Babel
#+property: header-args :session main :exports both :results table drawer

** HTML export
#+html_doctype: html5
#+options: html5-fancy:t
#+setupfile: ./org-html-themes/org/theme-readtheorg-local.setup

*** Styles
#+html_head_extra: <style>

#+html_head_extra: table {
#+html_head_extra:     overflow: auto;
#+html_head_extra:     display: block;
#+html_head_extra:     max-height: 10em;
#+html_head_extra: }

#+html_head_extra: .ansi {
#+html_head_extra:     white-space: pre;
#+html_head_extra: }

#+html_head_extra: </style>

*** Ansi output
#+name: format-ansi
#+begin_src bash :session none :var x="" :results verbatim html
  # echo "$x" | ansi2html --inline
  echo '<div class="codeblock ansi">'
  echo "$x" | ansi2html --inline --light-background
  echo "</div>"
#+end_src

* About
This document is written in emacs and org-mode, for export to html.

The inline code blocks in this document are executed sequentially in a single python session by org-babel. Usage here is meant to be representative of use during an interactive session.

=portfolio.visualize.Plot.embed()= produces a representation of the plot for embedding in an html document. For normal use, use =save= or =show= instead.

The source of this document and the project are available on GitHub [[https://github.com/Briaoeuidhtns/Machine-Learning][here]]. If you are viewing this on GitHub, an exported version with output and graphs is available [[https://briaoeuidhtns.github.io/Machine-Learning/readme.html][here]].

* Setup
Install the project dependencies via Poetry
#+begin_src bash :session none :results verbatim html :post format-ansi(x=*this*) :cache yes
  poetry install --no-interaction --ansi
#+end_src

Activate the venv. In emacs you can activate a venv located at =./.venv= via
#+begin_src emacs-lisp :results silent
  (pyvenv-activate ".venv")
#+end_src

Load iris dataset
#+begin_src python :results verbatim
  import numpy as np
  from portfolio.visualize import Plot

  from sklearn.datasets import load_iris
  iris = load_iris()

#+end_src

Get data for only type 1 and 2 for binary classifiers, and label as -1 or 1
#+begin_src python :results verbatim
  x = iris.data[iris.target > 0]
  y = np.where(iris.target[iris.target > 0] == 1, -1, 1)
#+end_src

* Models
** Perceptron
