readme.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <!-- 2020-12-09 Wed 03:43 -->
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>Machine Learning</title>
    <meta name="generator" content="Org mode" />
    <meta name="author" content="Brian Brunner" />
    <meta
      name="description"
      content="Final project for CSC 448: Machine Learning"
    />
    <link
      rel="stylesheet"
      type="text/css"
      href="src/readtheorg_theme/css/htmlize.css"
    />
    <link
      rel="stylesheet"
      type="text/css"
      href="src/readtheorg_theme/css/readtheorg.css"
    />
  </head>
  <body>
    <div id="content">
      <header>
        <h1 class="title">Machine Learning</h1>
        <p class="subtitle">Portfolio</p>
      </header>
      <nav id="table-of-contents">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents">
          <ul>
            <li><a href="#orgf38c560">1. About</a></li>
            <li><a href="#orgb609119">2. Setup</a></li>
            <li>
              <a href="#orgd7a62c8">3. Models</a>
              <ul>
                <li>
                  <a href="#org48c4818">3.1. Perceptron</a>
                  <ul>
                    <li>
                      <a href="#org9671176"
                        >3.1.1. Example runs from project description</a
                      >
                    </li>
                  </ul>
                </li>
                <li><a href="#org7ce8ab7">3.2. Linear Regression</a></li>
                <li><a href="#org86f7407">3.3. Decision Stumps</a></li>
                <li>
                  <a href="#org096b0f8">3.4. Support Vector Machine</a>
                  <ul>
                    <li><a href="#org2e6a09b">3.4.1. Soft SVM</a></li>
                  </ul>
                </li>
                <li><a href="#org2cc3b6e">3.5. K-Nearest Neighbor</a></li>
              </ul>
            </li>
          </ul>
        </div>
      </nav>
      <div id="outline-container-orgf38c560" class="outline-2">
        <h2 id="orgf38c560"><span class="section-number-2">1</span> About</h2>
        <div class="outline-text-2" id="text-1">
          <p>
            This document is written in emacs and org-mode, for export to html.
          </p>

          <p>
            The inline code blocks in this document are executed sequentially in
            a single python session by org-babel. Usage here is meant to be
            representative of use during an interactive session.
          </p>

          <p>
            <code>portfolio.visualize.Plot.embed()</code> produces a
            representation of the plot for embedding in an html document. For
            normal use, use <code>save</code> or <code>show</code> instead.
          </p>

          <p>
            The source of this document and the project are available on GitHub
            <a href="https://github.com/Briaoeuidhtns/Machine-Learning">here</a
            >. If you are viewing this on GitHub, an exported version with
            output and graphs is available
            <a
              href="https://briaoeuidhtns.github.io/Machine-Learning/readme.html"
              >here</a
            >.
          </p>
        </div>
      </div>

      <div id="outline-container-orgb609119" class="outline-2">
        <h2 id="orgb609119"><span class="section-number-2">2</span> Setup</h2>
        <div class="outline-text-2" id="text-2">
          <p>Install the project dependencies via Poetry</p>
          <div class="org-src-container">
            <pre class="src src-bash">
poetry install --no-interaction --ansi
</pre
            >
          </div>

          <div class="codeblock ansi">
            <span style="color: #0000aa"
              >Installing dependencies from lock file</span
            >

            No dependencies to install or update
          </div>

          <p>
            Activate the venv. In emacs you can activate a venv located at
            <code>./.venv</code> via
          </p>
          <div class="org-src-container">
            <pre
              class="src src-emacs-lisp"
            ><span style="color: #2aa198;">(</span>pyvenv-activate <span style="color: #2aa198;">".venv"</span><span style="color: #2aa198;">)</span>
</pre>
          </div>

          <p>Load iris dataset</p>
          <div class="org-src-container">
            <pre
              class="src src-python"
            ><span style="color: #859900; font-weight: bold;">import</span> numpy <span style="color: #859900; font-weight: bold;">as</span> np
<span style="color: #859900; font-weight: bold;">from</span> portfolio.visualize <span style="color: #859900; font-weight: bold;">import</span> Plot

<span style="color: #859900; font-weight: bold;">from</span> sklearn.datasets <span style="color: #859900; font-weight: bold;">import</span> load_iris
<span style="color: #268bd2;">iris</span> = load_iris<span style="color: #2aa198;">()</span>

</pre>
          </div>

          <p>
            Get data for only type 1 and 2 for binary classifiers, and label as
            -1 or 1
          </p>
          <div class="org-src-container">
            <pre
              class="src src-python"
            ><span style="color: #268bd2;">x</span> = iris.data<span style="color: #2aa198;">[</span>iris.target &gt; <span style="color: #6c71c4;">0</span><span style="color: #2aa198;">]</span>
<span style="color: #268bd2;">y</span> = np.where<span style="color: #2aa198;">(</span>iris.target<span style="color: #b58900;">[</span>iris.target &gt; <span style="color: #6c71c4;">0</span><span style="color: #b58900;">]</span> == <span style="color: #6c71c4;">1</span>, -<span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">1</span><span style="color: #2aa198;">)</span>
</pre>
          </div>
        </div>
      </div>
