readme.org
** Support Vector Machine
