readme.html

        <div id="outline-container-org096b0f8" class="outline-3">
          <h3 id="org096b0f8">
            <span class="section-number-3">3.4</span> Support Vector Machine
          </h3>
